{
  "date": "2018-05-13 00:00:00", 
  "text": [
    "This is a collection of short stories I have written.\n"
  ], 
  "hyperlink": "index.html", 
  "children": [
    {
      "date": "2018-05-08 00:00:00", 
      "text": [
        "The classroom was quiet, the only sound the scratching of styli across slate and the soft sussurus of cloth as the teacher circulated the room.\nA shadow appeared above Detsora&rsquo;s work, followed by a finger seemingly from the sky.\n&ldquo;What is this scribble here?&rdquo; said the owner of the finger.\nThe student looked up at her teacher, confused. &ldquo;It&rsquo;s my name. Detsora.&rdquo;\n&ldquo;That cannot be your name. We do not accept made&#x2011;up names here. Your name is here, on your nameplate.&rdquo; A tap on the plaque set just above her desk. &rdquo;Datirra. A lovely name. You should be proud of it.&rdquo;\n&ldquo;Yes, sensei.&rdquo; With some difficulty, Detsora copied the plaque onto her slate. She was still learning script, and yet she was always expected to keep up. She continued with her interrupted exercise as the teacher nodded in approval and moved on.\nIt was the first day of the week. Detsora couldn&rsquo;t completely follow the text she was copying. But it <em>was</em> the first day of the week, so she knew what it had to be:\n<em>&ldquo;I swear to follow the Queen, who shares the glory of Sa&rsquo;imi with the world.&rdquo;</em>\nSa&rsquo;imi, the lightbringer, the name given to the divine force of the Sun when high in the sky. Her father had taught her to honour the Lord of the Hunt and the Lady of the Hearth, but these cthonic deities were gone now, along with her father. The new teaching was that the Divine Parents had only ever been stories. Maybe that&rsquo;s all her father had been, also.\n<em>&ldquo;I swear to bring value to my country, raising weapons in war and lowering them in peace.&rdquo;</em>\nHer sister and brother had begun teaching her to fight, to protect herself. She had longed to grow up and join the Defence alongside her elder siblings, but that was no longer possible. Defence had fallen. They had let go of their weapons in wartime, and there was no one left to pick them up again.\n<em>&ldquo;I swear to uphold the traditions of this town, and to assist the administrators whenever I am required.&rdquo;</em>\nJust a few years ago, her grandparents had taken her to the annual harvest bonfire festival. Being related to the mayor had its advantages. Detsora had been the first one that year to be allowed to place her wishing scroll among the flames. The embers had risen to join the newly visible stars as dusk fell, carrying her wish with them. It had come true, too, although she was never quite able to believe it. If she&rsquo;d known what was to happen, though, she wouldn&rsquo;t have wasted that wish. Her grandparents were displayed for two whole days,  so that the townspeople would know the penalty for defying the invaders.\n<em>&ldquo;I swear to remain true as a citizen of this town, this country, this world.&rdquo;</em>\nRemain true. As easy as that. Remain true to what, though? Her mother had taught her about remaining true. She recalled the unshed tears in her mother&rsquo;s eyes as she was taken away from their home and brought to this school. Her mother had remained true to the lost ways and the lost people, and had been lost, too. Remain true&hellip;\n&hellip;to herself. She was the only one left, now. Who else was there to be true to? With a single motion, she erased her slate and began again. With shaking hands, she formed the glyphs for her <em>real</em> name, D&#x2011;E&#x2011;T&#x2011;S&#x2011;O&#x2011;R&#x2011;A.\n"
      ], 
      "hyperlink": "detsora'sdiary.html", 
      "children": [], 
      "name": "Detsora&rsquo;s Diary"
    }
  ], 
  "name": "Short Stories"
}